app/Http/Controllers/Auth/LoginController.php

select * from `schools` where `code` = 'SCH00003' and `status` = 1 and `schools`.`deleted_at` is null limit 1
---

            // Ambil data sekolah dari DB utama
            Log::channel('login')->info('[LOGIN][STEP 4] Memanggil School::on("mysql")->where("code", "' . $request->code . '") — mencari sekolah di database utama...');
            $school = School::on('mysql')
                ->where('code', $request->code)
                ->where('status', 1)
                ->first();

select * from `users` where (`email` = '20260301' or `mobile` = '20260301') and `users`.`deleted_at` is null limit 1
---

            // Ambil user dari DB sekolah — cari di KEDUA kolom email dan mobile
            Log::channel('login')->info('[LOGIN][STEP 6] Memanggil User::on("school")->where("email", "' . $request->email . '")->orWhere("mobile", "' . $request->email . '") — mencari user di database sekolah...');
            $user = \App\Models\User::on('school')
                ->where(function ($query) use ($request) {
                $query->where('email', $request->email)
                    ->orWhere('mobile', $request->email);
            })
                ->first();