app/Services/SubscriptionService.php

select * from `subscriptions` where `school_id` = 3 and date(`start_date`) <= '2026-02-25' and date(`end_date`) >= '2026-02-25' order by `created_at` desc limit 1
select * from `features` where `features`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22)
select * from `package_features` where `package_features`.`package_id` in (3)
select * from `packages` where `packages`.`id` in (3)
select * from `subscription_features` where `subscription_features`.`subscription_id` in (50)
select * from `subscriptions` where `school_id` = 3 and `package_type` = 0 and date(`start_date`) <= '2026-02-25' and date(`end_date`) >= '2026-02-25' and exists (select * from `subscription_bills` where `subscriptions`.`id` = `subscription_bills`.`subscription_id`) and exists (select * from `subscription_bills` where `subscriptions`.`id` = `subscription_bills`.`subscription_id` and exists (select * from `payment_transactions` where `subscription_bills`.`payment_transaction_id` = `payment_transactions`.`id` and `payment_status` = 'succeed')) and exists (select * from `subscription_features` where `subscriptions`.`id` = `subscription_features`.`subscription_id`) order by `created_at` desc limit 1
select * from `package_features` where `package_features`.`package_id` in (1)
select * from `packages` where `packages`.`id` in (1)
---
    public function active_subscription($schoolId)
    {
        $today_date = Carbon::now()->format('Y-m-d');
        $subscription = Subscription::where('school_id', $schoolId)->whereDate('start_date', '<=', $today_date)->whereDate('end_date', '>=', $today_date)->latest()->first();

        if ($subscription) {
            if ($subscription->package_type == 1) {
                // Postpaid
                $subscription = Subscription::where('school_id', $schoolId)->where('package_type', 1)->whereDate('start_date', '<=', $today_date)->whereDate('end_date', '>=', $today_date)->with('subscription_feature.feature', 'addons.feature', 'package.package_feature.feature')->doesntHave('subscription_bill')->has('subscription_feature')->latest()->first();
            } else {
                // Prepaid
                $subscription = Subscription::where('school_id', $schoolId)->where('package_type', 0)->whereDate('start_date', '<=', $today_date)->whereDate('end_date', '>=', $today_date)->with('package.package_feature.feature')->has('subscription_bill')->with('subscription_feature.feature')->with(['addons' => function ($q) {
                    $q->has('transaction')->with('feature')->whereHas('transaction', function ($q) {
                        $q->where('payment_status', "succeed");
                    });
                }])->whereHas('subscription_bill.transaction', function ($q) {
                    $q->where('payment_status', "succeed");
                })->has('subscription_feature')->latest()->first();