app/Http/Controllers/Api/PaymentApiController.php

    public function verify($id)
    {
        Log::channel('payment')->info('================================================================================');
        Log::channel('payment')->info('[VERIFY] PROSES DIMULAI');
        Log::channel('payment')->info('[VERIFY] Fungsi dipanggil: PaymentApiController::verify()');
        Log::channel('payment')->info('[VERIFY] Parameter: inquiry_id = ' . $id);

        $inquiry = SchoolInquiry::find($id);

        if (!$inquiry) {
            Log::channel('payment')->warning('[VERIFY] Inquiry TIDAK DITEMUKAN dengan ID: ' . $id);
            Log::channel('payment')->info('================================================================================');
            abort(404);
        }

        Log::channel('payment')->info('[VERIFY] Inquiry DITEMUKAN:', [
            'inquiry_id' => $inquiry->id,
            'school_name' => $inquiry->school_name,
            'school_email' => $inquiry->school_email,
            'invoice_number' => $inquiry->invoice_number,
            'payment_status' => $inquiry->payment_status,
            'price' => $inquiry->price,
        ]);

        // Ambil package berdasarkan package_id
        $package = Package::find($inquiry->package_id);
---
select * from `school_inquiries` where `school_inquiries`.`id` = '7' limit 1
select * from `packages` where `packages`.`id` = 3 and `packages`.`deleted_at` is null limit 1

    public function process(Request $request)
    {
        Log::channel('payment')->info('================================================================================');
        Log::channel('payment')->info('[PAYMENT PROCESS] PROSES DIMULAI');
        Log::channel('payment')->info('[PAYMENT PROCESS] Fungsi dipanggil: PaymentApiController::process()');
        Log::channel('payment')->info('[PAYMENT PROCESS] Timestamp: ' . now());
        Log::channel('payment')->info('[PAYMENT PROCESS] Data Input:', [
            'inquiry_id' => $request->inquiry_id,
            'amount' => $request->amount,
        ]);

        // ─── STEP 1: Validasi ───
        Log::channel('payment')->info('[PAYMENT PROCESS][STEP 1] Menjalankan validasi input...');
        $request->validate([
            'inquiry_id' => 'required|exists:school_inquiries,id',
            'amount' => 'required|numeric',
        ]);
        Log::channel('payment')->info('[PAYMENT PROCESS][STEP 1] Validasi BERHASIL');

        // ─── STEP 2: Ambil Inquiry ───
        Log::channel('payment')->info('[PAYMENT PROCESS][STEP 2] Memanggil SchoolInquiry::find(' . $request->inquiry_id . ')...');
        $inquiry = SchoolInquiry::find($request->inquiry_id);
---
select * from `school_inquiries` where `school_inquiries`.`id` = '3' limit 1

            DB::beginTransaction();
            Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 4] DB::beginTransaction() dipanggil');

            $inquiry = SchoolInquiry::where('invoice_number', $invoiceNumber)
                ->lockForUpdate()
                ->first();
---
select * from `school_inquiries` where `invoice_number` = 'JT-1771997295' limit 1 for update


            // ─── STEP 6: Buat school ───
            Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 6] Memanggil School::where("support_email", "' . $inquiry->school_email . '") — cek apakah school sudah ada...');
            $school = School::where('support_email', $inquiry->school_email)->first();

            if (!$school) {
                Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 6] School BELUM ADA — memanggil School::create() untuk membuat school baru...');
                $school = School::create([
                    'name' => $inquiry->school_name,
                    'support_email' => $inquiry->school_email,
                    'support_phone' => $inquiry->school_phone,
                    'address' => $inquiry->school_address ?? null,
                    'tagline' => $inquiry->school_tagline ?? null,
                    'status' => 1,
                    'installed' => 1,
                ]);
---
select * from `schools` where `support_email` = 'satrioathallah38@email.com' and `schools`.`deleted_at` is null limit 1
insert into `schools` (`name`, `support_email`, `support_phone`, `address`, `tagline`, `status`, `installed`, `updated_at`, `created_at`) values ('Satrio Athallah Kresno Pramudya', 'satrioathallah38@email.com', '087753177808', 'Jl. Teluk Betung I/8', 'Uji Coba pembuatan sekolah dengan password', 1, 1, '2026-02-25 12:29:03', '2026-02-25 12:29:03')

                Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 6] School SUDAH ADA (ID: ' . $school->id . ') — skip pembuatan');
            }

            Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 6] Memanggil school->update() — set code dan database_name...');
---
update `schools` set `code` = 'SCH00006', `database_name` = 'eschool_saas_6_satrio-athallah-kresno-pramudya', `schools`.`updated_at` = '2026-02-25 12:29:03' where `id` = 6


            // ─── STEP 7: Buat admin user ───
            Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 7] Memanggil User::where("email", "' . $inquiry->school_email . '") — cek apakah admin sudah ada...');
            $existingAdmin = User::where('email', $inquiry->school_email)->first();

            if (!$existingAdmin) {
                Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 7] Admin BELUM ADA — memanggil User::create() untuk membuat admin baru...');
                $admin = User::create([
                    'first_name' => 'School',
                    'last_name' => 'Admin',
                    'mobile' => $inquiry->school_phone,
                    'email' => $inquiry->school_email,
                    'password' => Hash::make($inquiry->school_phone),
                    'school_id' => $school->id,
                    'image' => 'dummy_logo.jpg',
                ]);
---
select * from `users` where `email` = 'satrioathallah38@email.com' and `users`.`deleted_at` is null limit 1
insert into `users` (`first_name`, `last_name`, `mobile`, `email`, `password`, `school_id`, `image`, `updated_at`, `created_at`) values ('School', 'Admin', '087753177808', 'satrioathallah38@email.com', '$2y$10$2FqdGtVN9zXR9Mc4XN7qyui5Eh7RCgmrUlRQCY4cnmY4RGXH4XyUS', 6, 'dummy_logo.jpg', '2026-02-25 12:29:03', '2026-02-25 12:29:03')

                ]);

                Log::channel('webhook')->info('[DOKU WEBHOOK][STEP 7] Memanggil Role::updateOrCreate() — assign role "School Admin"...');
                $role = Role::withoutGlobalScope('school')->updateOrCreate(
                ['name' => 'School Admin', 'school_id' => $school->id],
                ['custom_role' => 0, 'editable' => 0, 'guard_name' => 'web']
                );
---
insert into `roles` (`guard_name`, `name`, `school_id`, `custom_role`, `editable`, `updated_at`, `created_at`) values ('web', 'School Admin', 6, 0, 0, '2026-02-25 12:29:03', '2026-02-25 12:29:03')
select * from `roles` where (`name` = 'School Admin' and `school_id` = 6) limit 1

                    'role_name' => $role->name,
                ]);

                $school->update(['admin_id' => $admin->id]);
---
update `schools` set `admin_id` = 7, `schools`.`updated_at` = '2026-02-25 12:29:03' where `id` = 6

    public function checkPaymentStatus($id)
    {
        $inquiry = SchoolInquiry::find($id);
---
select * from `school_inquiries` where `school_inquiries`.`id` = '7' limit 1