PHP_Code/app/Http/Controllers/SchoolController.php

    public function verifyPage($id)
    {
        $inquiry = $this->schoolInquiry->builder()->find($id);
---
select * from `school_inquiries` where `school_inquiries`.`id` = '41' limit 1

            }

            if (count($row->subscription)) {
                $package = $row->subscription()->whereDate('start_date', '<=', $today_date)->whereDate('end_date', '>=', $today_date)->latest()->first();
---
select * from `subscriptions` where `subscriptions`.`school_id` = 9 and `subscriptions`.`school_id` is not null and date(`start_date`) <= '2026-02-17' and date(`end_date`) >= '2026-02-17' order by `created_at` desc limit 1


        // ─── STEP 3: Cek data existing ───
        Log::channel('registration')->info('[REGISTRASI][STEP 3] Mengecek data existing di database...');
        $school = $this->schoolsRepository->builder()->where('support_email', $request->school_email)->withTrashed()->first();
        $user = $this->userRepository->builder()->where('email', $request->school_email)->withTrashed()->first();
        $schoolInquiry = $this->schoolInquiry->builder()->where('school_email', $request->school_email)->first();
---
select * from `schools` where `support_email` = 'bbb@email.com' limit 1
select * from `users` where `email` = 'bbb@email.com' limit 1
select * from `school_inquiries` where `school_email` = 'bbb@email.com' limit 1

                );

                // Buat/update SchoolInquiry
                Log::channel('registration')->info('[REGISTRASI][STEP 6] Memanggil SchoolInquiry::updateOrCreate() — membuat atau memperbarui data inquiry...');
                $schoolData = $this->schoolInquiry->builder()->updateOrCreate(['school_email' => $request->school_email], $school_data);
---
insert into `school_inquiries` (`school_email`, `school_name`, `school_phone`, `school_tagline`, `school_address`, `package_id`, `price`, `invoice_number`, `payment_status`, `date`, `status`, `updated_at`, `created_at`) values ('iii@email.com', 'IIIIII', '765765', 'solsol', 'solsol', '1', 500000, 'JT-1771410166', 'pending', '2026-02-18', 0, '2026-02-18 17:22:46', '2026-02-18 17:22:46')
update `school_inquiries` set `school_name` = 'abca', `school_address` = 'AHHHAAAA', `school_phone` = '343416', `school_password` = '$2y$10$2tuQFf.YTC.0mBuxfrUYwuZTAKoytjPUFkT8EteAZqTjHJnOseVAS', `school_tagline` = 'AAAAAAAAAAAA', `date` = '2026-03-02', `package_id` = '2', `price` = 3000000, `invoice_number` = 'JT-1772443071', `payment_status` = 'pending', `school_inquiries`.`updated_at` = '2026-03-02 16:17:51' where `id` = 11
select * from `school_inquiries` where (`school_email` = 'bbb@email.com') limit 1

                ]);

                // Remove existing extra details to prevent duplicates
                $this->extraSchoolData->builder()->where('school_inquiry_id', $schoolData->id)->delete();
---
delete from `extra_school_datas` where `school_inquiry_id` = 11