PHP_Code/app/Http/Controllers/SchoolSettingsController.php

select `domain_type` from `schools` where `id` = 9 and `schools`.`deleted_at` is null
---
    public function index()
    {
        ResponseService::noPermissionThenRedirect('school-setting-manage');
        $settings = $this->cache->getSchoolSettings();
        $getDateFormat = getDateFormat();
        $getTimeFormat = getTimeFormat();
        $baseUrl = url('/');
        // Remove the scheme (http:// or https://)
        $baseUrlWithoutScheme = preg_replace("(^https?://)", "", $baseUrl);
        $baseUrlWithoutScheme = str_replace("www.", "", $baseUrlWithoutScheme);
        $baseUrlParts = parse_url($baseUrl);
        $host = $baseUrlParts['host'];
        $host = str_replace("www.", "", $host);
        $hostParts = explode('.', $host);

        if (count($hostParts) > 2) {
            if (strpos($baseUrlWithoutScheme, '.') !== false) {
                $baseUrlWithoutScheme = substr($baseUrlWithoutScheme, strpos($baseUrlWithoutScheme, '.') + 1);
            }
        }

        $systemSettings = $this->cache->getSystemSettings();
        $schoolService = app(SchoolDataService::class);
        DB::setDefaultConnection('mysql');
        $domain_type = School::where('id', Auth::user()->school_id)->pluck('domain_type')->first();