PHP_Code/app/Services/SchoolDataService.php

    public static function switchToSchoolDatabase($school_id)
    {
        $school_database = School::where('id', $school_id)->pluck('database_name')->first();
---
select `database_name` from `schools` where `id` = 9 and `schools`.`deleted_at` is null