PHP_Code/routes/web.php

select * from `packages` where `status` = 1 and `packages`.`deleted_at` is null order by `rank` asc
---
});

Route::get('register', function () {
    $packages = \App\Models\Package::where('status', 1)->orderBy('rank', 'ASC')->get();