PHP_Code/routes/web.php

delete from `school_inquiries` where `id` = 37
select * from `school_inquiries` where `school_inquiries`.`id` = '37' limit 1
---



Route::match (['get', 'post'], '/registration/cancel/{id}', function ($id) {
    $inquiry = \App\Models\SchoolInquiry::find($id);

    if (!$inquiry) {
        return redirect('/')->with('error', 'Data registrasi tidak ditemukan.');
    }

    // Hapus data terkait (extra school details)
    $inquiry->extra_school_details()->delete();

    // Hapus inquiry
    $inquiry->delete();

    return redirect('/')->with('success', 'Registrasi berhasil dibatalkan. Semua data telah dihapus.');
})->name('registration.cancel');