app/Http/Controllers/AuthController.php

    public function login()
    {
        if (Auth::user()) {
            return redirect('/dashboard');
        }
        $systemSettings = $this->cache->getSystemSettings();
        $extraFields = $this->formFields->defaultModel()->orderBy('rank')->get();
        // $schoolSettings = $this->cache->getSchoolSettings();
        $packages = $this->package->builder()->where('status', 1)->orderBy('rank', 'ASC')->get();
---
select * from `form_fields` where `form_fields`.`deleted_at` is null order by `rank` asc
select * from `packages` where `status` = 1 and `packages`.`deleted_at` is null order by `rank` asc

    public function logout(Request $request)
    {
        session(['logout_time' => now()]);
        $user = Auth::user();
        DB::table('users')->where('email', $user->email)->update(['two_factor_secret' => null, 'two_factor_expires_at' => null]);
---
update `users` set `two_factor_secret` = null, `two_factor_expires_at` = null where `email` = 'superadmin@gmail.com'