app/Http/Controllers/SchoolController.php

    public function verifyPage($id)
    {
        $inquiry = $this->schoolInquiry->builder()->find($id);
---
select * from `school_inquiries` where `school_inquiries`.`id` = '3' limit 1


        // ─── STEP 3: Cek data existing ───
        Log::channel('registration')->info('[REGISTRASI][STEP 3] Mengecek data existing di database...');
        $school = $this->schoolsRepository->builder()->where('support_email', $request->school_email)->withTrashed()->first();
        $user = $this->userRepository->builder()->where('email', $request->school_email)->withTrashed()->first();
        $schoolInquiry = $this->schoolInquiry->builder()->where('school_email', $request->school_email)->first();
---
select * from `schools` where `support_email` = 'email@email.com' limit 1
select * from `users` where `email` = 'email@email.com' limit 1
select * from `school_inquiries` where `school_email` = 'email@email.com' limit 1

                );

                // Buat/update SchoolInquiry
                Log::channel('registration')->info('[REGISTRASI][STEP 6] Memanggil SchoolInquiry::updateOrCreate() — membuat atau memperbarui data inquiry...');
                $schoolData = $this->schoolInquiry->builder()->updateOrCreate(['school_email' => $request->school_email], $school_data);
---
insert into `school_inquiries` (`school_email`, `school_name`, `school_phone`, `school_tagline`, `school_address`, `package_id`, `price`, `invoice_number`, `payment_status`, `date`, `status`, `updated_at`, `created_at`) values ('payment@email.com', 'test payment redirection', '343434', 'poe', 'popopoe', '1', 500000, 'JT-1771993514', 'pending', '2026-02-25', 1, '2026-02-25 11:25:14', '2026-02-25 11:25:14')
insert into `school_inquiries` (`school_email`, `school_name`, `school_phone`, `school_password`, `school_tagline`, `school_address`, `package_id`, `price`, `invoice_number`, `payment_status`, `date`, `status`, `updated_at`, `created_at`) values ('email@email.com', 'uji coba tes struk pembayaran', '999999', '$2y$10$QgMYA72.UNZoP9EZmoPmgOHs7MwXzG.4/2LeUqFRTJi7ICFiao8eC', 'pole position', 'Jl. Teluk Betung I/8', '3', 6000000, 'JT-1772072392', 'pending', '2026-02-26', 1, '2026-02-26 09:19:52', '2026-02-26 09:19:52')
select * from `school_inquiries` where (`school_email` = 'email@email.com') limit 1

                ]);

                // Remove existing extra details to prevent duplicates
                $this->extraSchoolData->builder()->where('school_inquiry_id', $schoolData->id)->delete();
---
delete from `extra_school_datas` where `school_inquiry_id` = 8

    public function sendMailIndex()
    {
        ResponseService::noAnyPermissionThenRedirect(['custom-school-email']);
        $schools = $this->schoolsRepository->builder()->pluck('name', 'id');
---
select `name`, `id` from `schools` where `schools`.`deleted_at` is null