app/Http/Controllers/StaffController.php

select * from `roles` where `custom_role` = 1 and not `name` = 'Teacher' and `school_id` = 44
select * from `form_fields` where `user_type` = 2 and `form_fields`.`deleted_at` is null order by `rank` asc
---
    public function index()
    {
        ResponseService::noFeatureThenRedirect('Staff Management');
        ResponseService::noPermissionThenRedirect('staff-list');
        $roles = Role::where('custom_role', 1)->whereNot('name', 'Teacher')->get();
        $schools = array();
        if (!Auth::user()->school_id) {
            $schools = $this->school->active()->pluck('name', 'id');
        }
        $features = $this->features->getFeatures();
        // $features = array();

        $allowances = [];
        $deductions = [];

        $sessionYears = [];
        $extraFields = [];

        if (Auth::user()->school_id) {
            $allowances = $this->payrollSetting->builder()->where('type', 'allowance')->get();
            $deductions = $this->payrollSetting->builder()->where('type', 'deduction')->get();
            $extraFields = $this->formFields->defaultModel()->where('user_type', 2)->orderBy('rank')->get();