PHP_Code/app/Http/Controllers/Api/ExternalApiController.php

    public function storeStudent(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'school_id' => 'required|numeric',
        ]);

        if ($validator->fails()) {
            return response()->json([
                'error' => true,
                'message' => 'Validation error',
                'data' => $validator->errors()
            ], 422);
        }

        $school_id = $request->school_id;
        $school = School::on('mysql')->find($school_id);
---
select * from `schools` where `schools`.`id` = 1 and `schools`.`deleted_at` is null limit 1